Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetModelObjects Method
 Gets the drawing model objects based on given model object identifier. If used from sheet model objects from all views are returned.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetModelObjects(
	Identifier ModelIdentifier
)
Public Function GetModelObjects (
	ModelIdentifier As Identifier
) As DrawingObjectEnumerator
Parameters
ModelIdentifier
Type: Tekla.Structures.Identifier
The identifier of the object in the model.
Return Value
Type: DrawingObjectEnumerator
The model objects.
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace